<?xml version="1.0" ?>
<net name="tf_final" version="10">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="1, 3, 224, 224" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="x:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="1562220913" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="1562820928" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_7" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="64" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="sequential_4/sequential_1/model1/Conv1_pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="sequential_4/sequential_1/model1/Conv1_pad/Pad:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>225</dim>
					<dim>225</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="sequential_4/sequential_1/model1/bn_Conv1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="68" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/Conv1/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="sequential_4/sequential_1/model1/Conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>225</dim>
					<dim>225</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_11577" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1796" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sequential_4/sequential_1/model1/bn_Conv1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/bn_Conv1/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="sequential_4/sequential_1/model1/Conv1_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/Conv1_relu/Relu6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="sequential_4/sequential_1/model1/expanded_conv_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="1860" size="576"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/expanded_conv_depthwise/depthwise/ReadVariableOp:0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="sequential_4/sequential_1/model1/expanded_conv_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_1158011585" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="2436" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="sequential_4/sequential_1/model1/expanded_conv_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/expanded_conv_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="sequential_4/sequential_1/model1/expanded_conv_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/expanded_conv_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="sequential_4/sequential_1/model1/expanded_conv_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 1, 1" offset="2500" size="512"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/expanded_conv_project/Conv2D/ReadVariableOp:0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="sequential_4/sequential_1/model1/expanded_conv_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_1158811593" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="3012" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="sequential_4/sequential_1/model1/expanded_conv_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/expanded_conv_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="sequential_4/sequential_1/model1/block_1_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 8, 1, 1" offset="3044" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_1_expand/Conv2D/ReadVariableOp:0">
					<dim>48</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="sequential_4/sequential_1/model1/block_1_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_add_1159611601" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="4580" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="sequential_4/sequential_1/model1/block_1_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_1_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="sequential_4/sequential_1/model1/block_1_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_1_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="1563421126" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="1564021177" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_52" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="64" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="sequential_4/sequential_1/model1/block_1_pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="sequential_4/sequential_1/model1/block_1_pad/Pad:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="sequential_4/sequential_1/model1/block_1_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="4772" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_1_depthwise/depthwise/ReadVariableOp:0">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="sequential_4/sequential_1/model1/block_1_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_1160411609" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="6500" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="sequential_4/sequential_1/model1/block_1_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_1_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="sequential_4/sequential_1/model1/block_1_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_1_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="sequential_4/sequential_1/model1/block_1_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="8, 48, 1, 1" offset="6692" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_1_project/Conv2D/ReadVariableOp:0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="sequential_4/sequential_1/model1/block_1_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_1161211617" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="8228" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="sequential_4/sequential_1/model1/block_1_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_1_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="sequential_4/sequential_1/model1/block_2_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 8, 1, 1" offset="8260" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_2_expand/Conv2D/ReadVariableOp:0">
					<dim>48</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="sequential_4/sequential_1/model1/block_2_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="data_add_1162011625" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="9796" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="sequential_4/sequential_1/model1/block_2_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_2_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="sequential_4/sequential_1/model1/block_2_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_2_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="sequential_4/sequential_1/model1/block_2_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="9988" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_2_depthwise/depthwise/ReadVariableOp:0">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="sequential_4/sequential_1/model1/block_2_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="data_add_1162811633" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="11716" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="sequential_4/sequential_1/model1/block_2_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_2_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="sequential_4/sequential_1/model1/block_2_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_2_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="sequential_4/sequential_1/model1/block_2_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="8, 48, 1, 1" offset="11908" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_2_project/Conv2D/ReadVariableOp:0">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="sequential_4/sequential_1/model1/block_2_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_1163611641" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="13444" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="sequential_4/sequential_1/model1/block_2_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_2_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="sequential_4/sequential_1/model1/block_2_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_2_add/add:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="sequential_4/sequential_1/model1/block_3_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 8, 1, 1" offset="13476" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_3_expand/Conv2D/ReadVariableOp:0">
					<dim>48</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="sequential_4/sequential_1/model1/block_3_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_1164411649" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="15012" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="sequential_4/sequential_1/model1/block_3_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_3_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="sequential_4/sequential_1/model1/block_3_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_3_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1564620916" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="1565221117" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_117" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="64" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="sequential_4/sequential_1/model1/block_3_pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="sequential_4/sequential_1/model1/block_3_pad/Pad:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="sequential_4/sequential_1/model1/block_3_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="15204" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_3_depthwise/depthwise/ReadVariableOp:0">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="sequential_4/sequential_1/model1/block_3_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_1165211657" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="16932" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="sequential_4/sequential_1/model1/block_3_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_3_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="sequential_4/sequential_1/model1/block_3_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_3_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="sequential_4/sequential_1/model1/block_3_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 48, 1, 1" offset="17124" size="3072"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_3_project/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="sequential_4/sequential_1/model1/block_3_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="data_add_1166011665" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="20196" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="sequential_4/sequential_1/model1/block_3_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_3_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="sequential_4/sequential_1/model1/block_4_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="20260" size="6144"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_4_expand/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="sequential_4/sequential_1/model1/block_4_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_1166811673" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="26404" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="sequential_4/sequential_1/model1/block_4_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_4_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="sequential_4/sequential_1/model1/block_4_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_4_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="sequential_4/sequential_1/model1/block_4_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="26788" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_4_depthwise/depthwise/ReadVariableOp:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="sequential_4/sequential_1/model1/block_4_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_1167611681" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="30244" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="sequential_4/sequential_1/model1/block_4_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_4_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="sequential_4/sequential_1/model1/block_4_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_4_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="sequential_4/sequential_1/model1/block_4_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 96, 1, 1" offset="30628" size="6144"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_4_project/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="sequential_4/sequential_1/model1/block_4_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_1168411689" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="36772" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="sequential_4/sequential_1/model1/block_4_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_4_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="sequential_4/sequential_1/model1/block_4_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_4_add/add:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="sequential_4/sequential_1/model1/block_5_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="36836" size="6144"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_5_expand/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="sequential_4/sequential_1/model1/block_5_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="data_add_1169211697" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="42980" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="sequential_4/sequential_1/model1/block_5_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_5_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="sequential_4/sequential_1/model1/block_5_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_5_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="sequential_4/sequential_1/model1/block_5_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="43364" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_5_depthwise/depthwise/ReadVariableOp:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="sequential_4/sequential_1/model1/block_5_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="data_add_1170011705" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="46820" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="sequential_4/sequential_1/model1/block_5_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_5_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="sequential_4/sequential_1/model1/block_5_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential_4/sequential_1/model1/block_5_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="sequential_4/sequential_1/model1/block_5_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 96, 1, 1" offset="47204" size="6144"/>
			<output>
				<port id="0" precision="FP32" names="sequential_4/sequential_1/model1/block_5_project/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="sequential_4/sequential_1/model1/block_5_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="data_add_1170811713" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="53348" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="sequential_4/sequential_1/model1/block_5_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential_4/sequential_1/model1/block_5_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="sequential_4/sequential_1/model1/block_5_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
